[{
        "id": 1,
        "countryName": "World",
        "capital": "No Capital",
        "population": "Null",
        "interestingFact": "There are 195 countries, including 193 UN members and 2 observers, spread across seven continents globally."
    },
    {
        "id": 2,
        "countryName": "Nepal",
        "capital": "Kathmandu",
        "population": 29609623,
        "interestingFact": "Mount Everest, the world's tallest mountain at 8,848 meters, lies in Nepal, attracting climbers from across the world."
    },
    {
        "id": 3,
        "countryName": "Egypt",
        "capital": "Cairo",
        "population": 104258327,
        "interestingFact": "The Pyramids of Giza, built over 4,500 years ago, are the last remaining wonders of the Ancient World, attracting millions."
    },
    {
        "id": 4,
        "countryName": "Australia",
        "capital": "Canberra",
        "population": 25687041,
        "interestingFact": "Australia’s Great Barrier Reef, spanning 2,300 km, is the largest coral reef system, home to thousands of marine species."
    },
    {
        "id": 5,
        "countryName": "Brazil",
        "capital": "Brasilia",
        "population": 213993437,
        "interestingFact": "The Amazon Rainforest, covering over 5.5 million square kilometers, produces 20% of the world’s oxygen, crucial for biodiversity."
    },
    {
        "id": 6,
        "countryName": "France",
        "capital": "Paris",
        "population": 67407241,
        "interestingFact": "The Eiffel Tower, originally a temporary exhibit in 1889, remains France’s most visited landmark, welcoming millions yearly."
    },
    {
        "id": 7,
        "countryName": "Russia",
        "capital": "Moscow",
        "population": 1324216107,
        "interestingFact": "Russia, covering over 17 million square kilometers, spans 11 time zones, making it the largest country by land area worldwide."
    },
    {
        "id": 8,
        "countryName": "China",
        "capital": "Beijing",
        "population": 1444216107,
        "interestingFact": "The Great Wall of China stretches over 21,000 km and, despite popular myths, is barely visible from space with the naked eye."
    },
    {
        "id": 9,
        "countryName": "India",
        "capital": "New Delhi",
        "population": 1380004385,
        "interestingFact": "India’s Taj Mahal, a UNESCO site, was built in the 17th century by Emperor Shah Jahan in memory of his wife Mumtaz Mahal."
    },
    {
        "id": 10,
        "countryName": "United States",
        "capital": "Washington, D.C.",
        "population": 331002651,
        "interestingFact": "The United States has the largest economy, contributing over 25% of global GDP, with Silicon Valley leading tech innovations."
    },
    {
        "id": 11,
        "countryName": "Canada",
        "capital": "Ottawa",
        "population": 37742154,
        "interestingFact": "Canada has the world's longest coastline, stretching over 202,080 km, and is home to vast boreal forests and fresh water lakes."
    },
    {
        "id": 12,
        "countryName": "Japan",
        "capital": "Tokyo",
        "population": 126476461,
        "interestingFact": "Japan consists of 6,800 islands, with Honshu being the largest. It is known for its rich culture, technology, and traditions."
    },
    {
        "id": 13,
        "countryName": "Germany",
        "capital": "Berlin",
        "population": 83783942,
        "interestingFact": "Germany, Europe’s largest economy, is famous for its automotive industry, Oktoberfest, and historical landmarks like the Berlin Wall."
    },
    {
        "id": 14,
        "countryName": "Italy",
        "capital": "Rome",
        "population": 60244639,
        "interestingFact": "Italy’s Colosseum, built around AD 80, is the largest ancient amphitheater, once hosting gladiator battles for Roman entertainment."
    },
    {
        "id": 15,
        "countryName": "South Africa",
        "capital": "Pretoria",
        "population": 59308690,
        "interestingFact": "South Africa, with 11 official languages, was the first African nation to host the FIFA World Cup in 2010, uniting cultures."
    }
]